iPig/src/Reports/ЧисленностьСвиней/ЧисленностьСвиней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЧисленностьСвиней</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

iPig/src/InformationRegisters/КарточкаСвиноматки/КарточкаСвиноматки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаСвиноматки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Падеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кормилица</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоПотеряноКормодней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПадежПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейДо1Осеменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАбортов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МертворожденныхНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятыхПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятоНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПадежДоОтъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СупоросныхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодсосныхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПустыхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОпоросовНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПустыеКормодни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятоПоросятНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСлучка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХрякОсеменен</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУЗИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатУЗИ</name>
    <type>
      <types>EnumRef.РезультатУЗИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАборта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МачехаАборт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МачехаОтъем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо1Случки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПустыеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛактации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсосныйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛевыхСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравыхСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияОтец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияМать</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.КритическиеДни</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пролечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Хряк</name>
  </enumValues>
  <enumValues>
    <name>Свинка</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Reports/ЧисленностьСвиней/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере(ТабДок)  
	ТабДок.Очистить();
	Макет = Отчеты.ЧисленностьСвиней.ПолучитьМакет("Макет");
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Дата = Отчет.Дата;
	ТабДок.Вывести(ОбластьШапка); 
	ОбластьХряки = Макет.ПолучитьОбласть("Хряки");
	ОбластьСвинки = Макет.ПолучитьОбласть("Свинки");
	ОбластьСуп = Макет.ПолучитьОбласть("Суп");
	ОбластьЛакт = Макет.ПолучитьОбласть("Лакт");
	ОбластьПустые = Макет.ПолучитьОбласть("Пустые");
	ОбластьРем = Макет.ПолучитьОбласть("Рем");
	ОбластьПодсосные = Макет.ПолучитьОбласть("Подсосные");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЖурналОтъемаСрезПоследних.Период) КАК ДатаОтъема,
		|	МАКСИМУМ(ЖурналОтъемаСрезПоследних.Период) КАК ДатаОпороса,
		|	МАКСИМУМ(ЖурналОсемененияСрезПоследних.Период) КАК ДатаОсеменения,
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса КАК НомерОпороса,
		|	КарточкаСвиноматкиСрезПоследних.Период КАК ДатаВвода,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного КАК НомерЖивотного,
		|	ЗНАЧЕНИЕ(Перечисление.Пол.Свинка) КАК Пол,
		|	СУММА(ЕСТЬNULL(КарточкаВнесенияДанных.МассаВвод, 0)) КАК МассаВвод,
		|	СУММА(ЕСТЬNULL(ЖурналОпоросаСрезПоследних.ПереведеноПоросят, 0)) КАК ПереведеноПоросят,
		|	СУММА(ЕСТЬNULL(ЖурналОпоросаСрезПоследних.МассаВсего, 0)) КАК МассаВсего
		|ИЗ
		|	РегистрСведений.КарточкаСвиноматки.СрезПоследних КАК КарточкаСвиноматкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема.СрезПоследних КАК ЖурналОтъемаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОтъемаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОтъемаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения.СрезПоследних КАК ЖурналОсемененияСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОсемененияСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОсемененияСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса.СрезПоследних КАК ЖурналОпоросаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОпоросаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОпоросаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.Период = КарточкаВнесенияДанных.Период
		|ГДЕ
		|	КарточкаСвиноматкиСрезПоследних.ДатаВыбытие = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса,
		|	КарточкаСвиноматкиСрезПоследних.Период,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КарточкаХряка.Период,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	КарточкаХряка.НомерЖивотного,
		|	ЗНАЧЕНИЕ(Перечисление.Пол.Хряк),
		|	СУММА(ЕСТЬNULL(КарточкаВнесенияДанных.МассаВвод, 0)),
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.КарточкаХряка КАК КарточкаХряка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
		|		ПО КарточкаХряка.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
		|			И КарточкаХряка.Период = КарточкаВнесенияДанных.Период
		|ГДЕ
		|	КарточкаХряка.ДатаВыбытие = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	КарточкаХряка.НомерЖивотного,
		|	КарточкаХряка.Период";
		
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	КолХряки = 0; 
	ВесХряки = 0;
	КолСвинки = 0;
	ВесСвинки = 0;
	КолСуп = 0;
	ВесСуп = 0;
	КолЛакт = 0;
	ВесЛакт = 0;
	КолПустые = 0;
	ВесПустые = 0; 
	КолРем = 0;
	ВесРем = 0;
	КолПодсосные = 0;
	ВесПодсосные = 0;
    НомерЖивотного = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.НомерЖивотного <> НомерЖивотного Тогда
		//Хряки
		Если ВыборкаДетальныеЗаписи.Пол = Перечисления.Пол.Хряк Тогда  		
            КолХряки = КолХряки + 1;
			ВесХряки = ВесХряки + ВыборкаДетальныеЗаписи.МассаВвод;	
		КонецЕсли; 
		Если ВыборкаДетальныеЗаписи.НомерОпороса = 0 Тогда
            //Рем
			КолРем = КолРем + 1;
			ВесРем = ВесРем + ВыборкаДетальныеЗаписи.МассаВвод;					
		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегПоследнееСобытие.ПоследнееСобытие КАК ПоследнееСобытие
				|ИЗ
				|	РегистрСведений.ПоследнееСобытие КАК РегПоследнееСобытие
				|ГДЕ
				|	РегПоследнееСобытие.НомерЖивотного = &НомерЖивотного
				|	И РегПоследнееСобытие.ДатаВвода = &ДатаВвода";	
			Запрос.УстановитьПараметр("НомерЖивотного", ВыборкаДетальныеЗаписи.НомерЖивотного);	 
			Запрос.УстановитьПараметр("ДатаВвода", ВыборкаДетальныеЗаписи.ДатаВвода);	
			РезультатЗапроса = Запрос.Выполнить();	
			Выборка = РезультатЗапроса.Выбрать();	
			Пока Выборка.Следующий() Цикл
				Если Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Случка  ИЛИ Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.УЗИ Тогда
					//Свинки 
					Если ВыборкаДетальныеЗаписи.НомерОпороса = 1 И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОпороса) Тогда  
						КолСвинки = КолСвинки + 1;
						ВесСвинки = ВесСвинки + ВыборкаДетальныеЗаписи.МассаВвод;	
			  		//Суп
					Иначе
						КолСуп = КолСуп + 1;
						ВесСуп = ВесСуп + ВыборкаДетальныеЗаписи.МассаВвод;
					КонецЕсли;
				//Лакт	
				ИначеЕсли Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос Тогда	 						
					КолЛакт = КолЛакт + 1;
					ВесЛакт = ВесЛакт + ВыборкаДетальныеЗаписи.МассаВвод; 
				//Пустые
				ИначеЕсли Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Отъем ИЛИ Выборка.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Аборт Тогда
					КолПустые = КолПустые + 1;
					ВесПустые = ВесПустые + ВыборкаДетальныеЗаписи.МассаВвод;
				КонецЕсли;
			КонецЦикла; 		
		КонецЕсли;
        //Подсосные 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПереведеноПоросят) Тогда
		    КолПодсосные = КолПодсосные + ВыборкаДетальныеЗаписи.ПереведеноПоросят;
			   ВесПодсосные = ВесПодсосные + ВыборкаДетальныеЗаписи.МассаВсего; 
		КонецЕсли;
	КонецЕсли;
	НомерЖивотного = ВыборкаДетальныеЗаписи.НомерЖивотного;
	КонецЦикла;  
	//Хряки
	ОбластьХряки.Параметры.Хряки = Перечисления.ТипыСвиней.Хряки;
	ОбластьХряки.Параметры.КолХряки = КолХряки;
	ОбластьХряки.Параметры.ВесХряки = ВесХряки;
	Если КолХряки > 0 Тогда                      
		ОбластьХряки.Параметры.СреднийВесХряки = ВесХряки/КолХряки;
	КонецЕсли;
    ТабДок.Вывести(ОбластьХряки); 
	//Свинки
	ОбластьСвинки.Параметры.Свинки = Перечисления.ТипыСвиней.Свинки;
	ОбластьСвинки.Параметры.КолСвинки = КолСвинки;
	ОбластьСвинки.Параметры.ВесСвинки = ВесСвинки;
	Если КолСвинки > 0 Тогда                      
		ОбластьСвинки.Параметры.СреднийВесСвинки = ВесСвинки/КолСвинки;
	КонецЕсли;
    ТабДок.Вывести(ОбластьСвинки);
	//Суп
    ОбластьСуп.Параметры.Суп = Перечисления.ТипыСвиней.СупоросныеСвиноматки;
	ОбластьСуп.Параметры.КолСуп = КолСуп;
	ОбластьСуп.Параметры.ВесСуп = ВесСуп;
	Если КолСуп > 0 Тогда                      
		ОбластьСуп.Параметры.СреднийВесСуп = ВесСуп/КолСуп;
	КонецЕсли;
    ТабДок.Вывести(ОбластьСуп);
    //Лакт
    ОбластьЛакт.Параметры.Лакт = Перечисления.ТипыСвиней.ЛактирующиеСвиноматки;
	ОбластьЛакт.Параметры.КолЛакт = КолЛакт;
	ОбластьЛакт.Параметры.ВесЛакт = ВесЛакт;
	Если КолЛакт > 0 Тогда                      
		ОбластьЛакт.Параметры.СреднийВесЛакт = ВесЛакт/КолЛакт;
	КонецЕсли;
    ТабДок.Вывести(ОбластьЛакт);
	//Пустые
    ОбластьПустые.Параметры.Пустые = Перечисления.ТипыСвиней.ПустыеСвиноматки;
	ОбластьПустые.Параметры.КолПустые = КолПустые;
	ОбластьПустые.Параметры.ВесПустые = ВесПустые;
	Если КолПустые > 0 Тогда                      
		ОбластьПустые.Параметры.СреднийВесПустые = ВесПустые/КолПустые;
	КонецЕсли;
    ТабДок.Вывести(ОбластьПустые);
	//Рем
    ОбластьРем.Параметры.Рем = Перечисления.ТипыСвиней.РемСвинки;
	ОбластьРем.Параметры.КолРем = КолРем;
	ОбластьРем.Параметры.ВесРем = ВесРем;
	Если КолРем > 0 Тогда                      
		ОбластьРем.Параметры.СреднийВесРем = ВесРем/КолРем;
	КонецЕсли;
    ТабДок.Вывести(ОбластьРем);
	//Подсосные
    ОбластьПодсосные.Параметры.Подсосные = Перечисления.ТипыСвиней.ПодсосныеПоросята;
	ОбластьПодсосные.Параметры.КолПодсосные = КолПодсосные;
	ОбластьПодсосные.Параметры.ВесПодсосные = ВесПодсосные;
	Если КолПодсосные > 0 Тогда                      
		ОбластьПодсосные.Параметры.СреднийВесПодсосные = ВесПодсосные/КолПодсосные;
	КонецЕсли;
    //ТабДок.Вывести(ОбластьПодсосные);
	//Итого
	ИтогоКол = КолХряки + КолСвинки + КолСуп + КолЛакт + КолПустые + КолРем; // + КолПодсосные;
	ИтогоВес = ВесХряки + ВесСвинки + ВесСуп + ВесЛакт + ВесПустые + ВесРем; // + ВесПодсосные;
	ОбластьПодвал.Параметры.ИтогоКол = ИтогоКол;
	ОбластьПодвал.Параметры.ИтогоВес = ИтогоВес;
	Если ИтогоКол > 0 Тогда                      
		ОбластьПодвал.Параметры.ИтогоСреднийВес = ИтогоВес/ИтогоКол;
	КонецЕсли;
    ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)                                                                                                    
	ПечатьОтчетаНаКлиенте();

	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетаНаКлиенте()
	
	СформироватьНаСервере(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Дата = ТекущаяДата();  
	ПечатьОтчетаНаКлиенте();

КонецПроцедуры
